{
  "articles": [
    {
      "publishedAt": "2025-08-14T17:05:51+0000",
      "title": "3 charts that show Palantir's astronomical growth over the last five years",
      "description": "The artificial intelligence-powered software company's cofounders include renowned venture capitalist Peter Thiel and current CEO Alex Karp.",
      "source": {
        "name": "CNBC",
        "id": "cnbc"
      },
      "imageUrl": "https://image.cnbcfm.com/api/v1/image/101701316-173313274.jpg?v=1755185385",
      "sourceUrl": "https://www.cnbc.com/2025/08/14/palantir-ai-charts-revenue.html",
      "url": "https://newsfilter.io/articles/3-charts-that-show-palantirs-astronomical-growth-over-the-last-five-years-a7ecb5e9c4071ecfbc3ed41d820b096f",
      "html_content": "Latest NewsSVB NewsLIVEAnalyst RatingsFDA ApprovalsMerger & AcquisitionsSearch by:Symbol(s)Comma-seperate tickers for multi-ticker search. Use*to search for articles mentioning at least 1 ticker.KeywordsElon Musklooks for \"Elon\" OR \"Musk\"Put phrase inside quotes for an exact match. This is particularly useful for names:\"Elon Musk\",\"FDA Approval\"Use the minus (-) operator to exclude results which match specific keywords:\"Elon Musk\" -TeslaUse*as wildcard to match any character:acqui*matchesacquireandacquisitionUse AND to search for multiple keywords in the same article:Tesla AND \"Elon Musk\"Use OR to search for multiple keywords in the same article:\"Elon Musk\" OR \"Jack Dorsey\"Source(s)Select...Search11 hours ago |August 14, 2025 at 5:05 PM UTC| CNBC3 charts that show Palantir's astronomical growth over the last five yearsPLTRGSAAPLMSFTNVDATSLAShareTwitterFacebookLinkedInEmailCopy LinkSummaryPalantir shares have increased by over 1,700% since its 2020 NYSE debut.Government contracts, particularly with the U.S. Department of Defense, are major revenue drivers.Palantir's market valuation exceeds $430 billion, reaching new highs among tech peers.The company's shares have remained above $100 since April 2025, with retail investors contributing significantly.U.S. government revenue grew 53% to $426 million last quarter, accounting for 55% of total revenue.A $10 billion contract with the U.S. Army was signed recently for data & software services.U.S. revenues have increased from $156 million to $733 million in five years, while international revenues doubled to $271 million.Palantir reported over $1 billion in quarterly revenue for the first time, with a forward PE ratio exceeding 280 times.Palantir's stock is among the top 10 U.S. tech firms & top 20 most valuable U.S. companies despite lower revenue compared to peers.Link to original articleSearch by:Symbol(s)Comma-seperate tickers for multi-ticker search. Use*to search for articles mentioning at least 1 ticker.KeywordsElon Musklooks for \"Elon\" OR \"Musk\"Put phrase inside quotes for an exact match. This is particularly useful for names:\"Elon Musk\",\"FDA Approval\"Use the minus (-) operator to exclude results which match specific keywords:\"Elon Musk\" -TeslaUse*as wildcard to match any character:acqui*matchesacquireandacquisitionUse AND to search for multiple keywords in the same article:Tesla AND \"Elon Musk\"Use OR to search for multiple keywords in the same article:\"Elon Musk\" OR \"Jack Dorsey\"Source(s)Select...SearchMarketsLatest NewsAnalyst RatingsEarnings Call TranscriptsSPACs & IPOsFDA ApprovalsShow moreSector NewsHealthcareTechnologyEnergyIndustrialsConsumer DefensiveShow moreLatest FromCNBCReutersBloombergPR NewswireWall Street JournalShow moreUS GovernmentSEC FilingsClinical TrialsPatent Applications & ApprovalsFDA - Drug ApprovalsFDA - Press ReleasesShow moreAPI, DevelopersAPI DocumentationAPI PricingDiscord News BotAccountSign InCreate Free AccountTerms|PrivacyRisk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks. Before deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed. We would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily provided by any market or exchange, but may be provided by market makers, and so prices may not be accurate and may differ from the actual price at any given market, meaning prices are indicative and not appropriate for trading purposes. We and any provider of the data contained in this website will not accept liability for any loss or damage as a result of your trading, or your reliance on the information contained within this website. It is prohibited to use, store, reproduce, display, modify, transmit or distribute the data contained in this website without the explicit prior written permission of we and/or the data provider. All intellectual property rights are reserved by the providers and/or the exchange providing the data contained in this website. We may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers."
    }
  ],
  "timestamp": "2025-08-15T00:19:24.947108",
  "symbol": "TSLA",
  "type": "news"
}