{
  "articles": [
    {
      "publishedAt": "2025-08-13T19:42:25-04:00",
      "title": "Expion360 Inc. (XPON) Q2 2025 Earnings Call Transcript",
      "description": "Expion360 Inc. (XPON) Q2 2025 Earnings Call Transcript",
      "source": {
        "name": "Earnings Call Transcripts",
        "id": "earningsCallTranscripts"
      },
      "imageUrl": null,
      "sourceUrl": "https://newsfilter.io/articles/expion360-inc-xpon-q2-2025-earnings-call-transcript-fd26bac0e80dab379f93e243cb11ccd0",
      "url": "https://newsfilter.io/articles/expion360-inc-xpon-q2-2025-earnings-call-transcript-fd26bac0e80dab379f93e243cb11ccd0",
      "html_content": "Latest NewsSVB NewsLIVEAnalyst RatingsFDA ApprovalsMerger & AcquisitionsSearch by:Symbol(s)Comma-seperate tickers for multi-ticker search. Use*to search for articles mentioning at least 1 ticker.KeywordsElon Musklooks for \"Elon\" OR \"Musk\"Put phrase inside quotes for an exact match. This is particularly useful for names:\"Elon Musk\",\"FDA Approval\"Use the minus (-) operator to exclude results which match specific keywords:\"Elon Musk\" -TeslaUse*as wildcard to match any character:acqui*matchesacquireandacquisitionUse AND to search for multiple keywords in the same article:Tesla AND \"Elon Musk\"Use OR to search for multiple keywords in the same article:\"Elon Musk\" OR \"Jack Dorsey\"Source(s)Select...Search1 day ago |August 13, 2025 at 11:42 PM UTC| EARNINGS CALL TRANSCRIPTSExpion360 Inc. (XPON) Q2 2025 Earnings Call TranscriptXPONShareTwitterFacebookLinkedInEmailCopy LinkExpion360 Inc. (NASDAQ:XPON) Q2 2025 Earnings Conference Call August 13, 2025 4:30 PM ETCompany ParticipantsBrian Schaffner - Interim CFO, Principal Financial and Accounting Officer, CEO & DirectorConference Call ParticipantsLarry Holub - Unidentified CompanyOperatorGreetings, and welcome to the Expion360 Second Quarter 2025 Financial Results Conference Call. [Operator Instructions] As a reminder, this conference is being recorded and will be available on the company's Investor Relations website at investors.expion360.com.Before we begin the formal presentation, I would like to remind everyone that certain statements made on this call and through the webcast are forward-looking statements within the meaning of federal securities laws and are subject to considerable risks and uncertainties. These forward-looking statements are intended to qualify for the safe harbor from liability established by the Private Securities Litigation Reform Act of 1995.All statements made on this call today, other than statements of historical facts are forward-looking statements and include statements regarding the company's beliefs, plans and expectations about its operations, growth prospects product development and pipeline ability to execute its long-term growth strategy, anticipated timing of commercial availability of its products, market size and opportunity, the anticipated incremental revenue to be generated from new OEM partnership and distributors; potential partnerships or collaborations with third parties and the anticipated use of proceeds from the company's public offerings.While these forward-looking statements represent management's current beliefs and expectations, they are subject to risks and uncertainties that could cause actual results to differ materially. The company has explained some of these risks and uncertainties in its SEC filings, including the Risk Factors section of its annual report on Form 10-K. You are cautioned not to place undue reliance on these forward-looking statements, which reflect our expectations as of the date of this presentation. Except as required by law or the NASDAQ listing standards, theSearch by:Symbol(s)Comma-seperate tickers for multi-ticker search. Use*to search for articles mentioning at least 1 ticker.KeywordsElon Musklooks for \"Elon\" OR \"Musk\"Put phrase inside quotes for an exact match. This is particularly useful for names:\"Elon Musk\",\"FDA Approval\"Use the minus (-) operator to exclude results which match specific keywords:\"Elon Musk\" -TeslaUse*as wildcard to match any character:acqui*matchesacquireandacquisitionUse AND to search for multiple keywords in the same article:Tesla AND \"Elon Musk\"Use OR to search for multiple keywords in the same article:\"Elon Musk\" OR \"Jack Dorsey\"Source(s)Select...SearchMarketsLatest NewsAnalyst RatingsEarnings Call TranscriptsSPACs & IPOsFDA ApprovalsShow moreSector NewsHealthcareTechnologyEnergyIndustrialsConsumer DefensiveShow moreLatest FromCNBCReutersBloombergPR NewswireWall Street JournalShow moreUS GovernmentSEC FilingsClinical TrialsPatent Applications & ApprovalsFDA - Drug ApprovalsFDA - Press ReleasesShow moreAPI, DevelopersAPI DocumentationAPI PricingDiscord News BotAccountSign InCreate Free AccountTerms|PrivacyRisk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks. Before deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed. We would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily provided by any market or exchange, but may be provided by market makers, and so prices may not be accurate and may differ from the actual price at any given market, meaning prices are indicative and not appropriate for trading purposes. We and any provider of the data contained in this website will not accept liability for any loss or damage as a result of your trading, or your reliance on the information contained within this website. It is prohibited to use, store, reproduce, display, modify, transmit or distribute the data contained in this website without the explicit prior written permission of we and/or the data provider. All intellectual property rights are reserved by the providers and/or the exchange providing the data contained in this website. We may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers."
    },
    {
      "publishedAt": "2025-08-13T20:05:00Z",
      "title": "Expion360 Reports Second Quarter 2025 Financial and Operational Results",
      "description": "Q2 2025 Sales Growth of 134% to $3.0 Million Fueled by Strong Demand for New Products and Technologies Records Two of the Most Successful Months of Sales in Company History in Q2 2025 Sixth Consecutive Quarter of",
      "source": {
        "name": "GlobeNewswire",
        "id": "globenewswire"
      },
      "imageUrl": null,
      "sourceUrl": "https://newsfilter.io/articles/expion360-reports-second-quarter-2025-financial-and-operational-results-b2882b82e0200de702f3332fbeb4e4b7",
      "url": "https://newsfilter.io/articles/expion360-reports-second-quarter-2025-financial-and-operational-results-b2882b82e0200de702f3332fbeb4e4b7",
      "html_content": "Latest NewsSVB NewsLIVEAnalyst RatingsFDA ApprovalsMerger & AcquisitionsSearch by:Symbol(s)Comma-seperate tickers for multi-ticker search. Use*to search for articles mentioning at least 1 ticker.KeywordsElon Musklooks for \"Elon\" OR \"Musk\"Put phrase inside quotes for an exact match. This is particularly useful for names:\"Elon Musk\",\"FDA Approval\"Use the minus (-) operator to exclude results which match specific keywords:\"Elon Musk\" -TeslaUse*as wildcard to match any character:acqui*matchesacquireandacquisitionUse AND to search for multiple keywords in the same article:Tesla AND \"Elon Musk\"Use OR to search for multiple keywords in the same article:\"Elon Musk\" OR \"Jack Dorsey\"Source(s)Select...Search1 day ago |August 13, 2025 at 8:05 PM UTC| GLOBENEWSWIREExpion360 Reports Second Quarter 2025 Financial and Operational ResultsXPONShareTwitterFacebookLinkedInEmailCopy LinkQ2 2025 Sales Growth of 134% to $3.0 Million Fueled by Strong Demand for New Products and TechnologiesRecords Two of the Most Successful Months of Sales in Company History in Q2 2025Sixth Consecutive Quarter of Sales GrowthREDMOND, Ore., Aug.  13, 2025  (GLOBE NEWSWIRE) --Expion360 Inc.(NASDAQ:XPON) (\"Expion360\" or the \"Company\"), an industry leader in lithium iron phosphate battery power storage, today reported its financial and operational results for the first quarter ended June 30, 2025.Second Quarter 2025 and Subsequent Financial and Operational HighlightsQ2 2025 net sales totaled $3.0 million, up 134% from Q2 2024, and up 46% from Q1 2025.First half 2025 net sales of $5.0 million, up 124% from the first half of 2024.6th consecutive quarter of sales growth.Gross profit increased 91% compared to Q2 2024.First half 2025 operating cash burn improved 52% compared to the first half of 2024.$1.4 million in cash, cash equivalents and accounts receivable.Regained compliance with Nasdaq Listing Rule 5550(a)(2) as of August 13, 2025.Management Commentary\"The second quarter of 2025 was highlighted by two of the most successful sales months in our history, providing exceptional sales growth and momentum,\" said Brian Schaffner, Chief Executive Officer and Interim Chief Financial Officer. \"Net sales grew 134% year over year to $3.0 million, and sequentially for a sixth consecutive quarter on strong organic sales within our large customer base of dealers, distributors, OEMs and private label clients.\"Gross margin was adversely affected by ongoing tariff uncertainty during the quarter and increased volume of lower margin pass-through product sales, decreasing from 24% in Q1 2025 to 21% in Q2 2025. Gross margin impact was partially offset by our previous tariff mitigation efforts of adding 6-12 months of inventory before new tariffs were introduced, which reduced costs within our current line of batteries. We are also seeking to improve margins by diversifying our supply chain and have already transitioned certain products to U.S.-based manufacturers. This shift has resulted in lower costs for these products given the current tariff environment—particularly for steel and aluminum accessories—and we continue to explore additional sourcing opportunities from other countries. Our long-term goal is to onshore manufacturing of most of our components and assemblies. We are also actively engaged with resources in Washington, D.C. to advocate for reduced tariff impacts on our business and operations.\"\"Our Home Energy Storage Solutions (HESS), which began production earlier this year, enable residential and small business customers to create their own stable micro-energy grid and lessen the impact of increasing power fluctuations and outages. Of our two home energy product options, one has achieved UL9540 certification, and the second is in the final stages of UL approval. Proper UL certification is vital as states such as California require UL9540 certification of the battery and inverter system to qualify for tax credits.\"\"Looking ahead, with our current balance sheet positioning, from a combination of cash, receivables, and strong inventory levels, we believe we are well positioned to execute on our key growth initiatives, including adding OEM partnerships and distributors, further developing HESS, and introducing new technologies and batteries. We remain focused on expanding distribution and advancing our lithium-ion battery technology,\" concluded Mr. Schaffner.Second Quarter 2025 Financial SummaryNet sales in the second quarter of 2025 totaled $3.0 million, an increase of 134% from $1.3 million in the prior year period. The increase in net sales was primarily attributable to sales growth in the RV market along with accessory sales growth through integrator partners.Gross profit totaled $0.6 million, or 21% as a percentage of sales, as compared to $0.3 million, or 25% as a percentage of sales, in the prior year period. The decrease in gross margin percentage was primarily attributable to the product mix sold in different periods.Selling, general and administrative expenses were $2.0 million, which was relatively flat compared to the prior year period, but reflecting a decrease of 91 percentage points as a percentage of sales, from 157% of sales in the second quarter of 2024 to 66% of sales in the second quarter of 2025. The nominal decrease was primarily due to reduced costs of rent and related expenses, partially offset by smaller increases in travel expense, research and development, and other expenses.Net loss totaled $1.4 million, a 38% improvement from $2.2 million in the prior year period. The decrease in net loss was primarily the result of higher net sales combined with relatively flat selling, general, and administrative expenses.First Half 2025 Financial SummaryFor the six months ended June 30, 2025, net sales totaled $5.0 million, an increase of 124% from $2.2 million in the prior year period. The increase in net sales was primarily attributable to sales growth in the RV market along with accessory sales growth through integrator partners.Gross profit totaled $1.1 million, or 22% as a percentage of sales, compared to $0.5 million, or 24% as a percentage of sales, in the prior year period. The decrease in gross margin percentage was primarily attributable to the product mix sold in different periods.Selling, general and administrative expenses decreased 14% to $3.6 million compared to $4.2 million in the prior year period, and decreased as a percentage of sales by 114 percentage points, from 186% of sales in the first half of 2024 to 72% of sales in the first half of 2025. The decrease was primarily due to decreases in salaries and benefits, rent and related expenses, and legal and professional fees, slightly offset by an increase in research and development expenses.Net loss totaled $2.5 million, a 43% improvement from $4.4 million in the prior year period. The decrease in net loss was primarily the result of higher net sales for the period combined with a decrease in selling, general, and administrative expenses.Cash and cash equivalents totaled $0.7 million as of June 30, 2025, compared to $0.5 million as of December 31, 2024.Net cash used in operating activities totaled $1.6 million, compared to $3.4 million in the prior year period. Receiving inventory that was prepaid during the prior period accounted for the majority of the change for the six months ended June 30, 2025.Compliance with Nasdaq Listing RulesThe Company has regained compliance with the Nasdaq minimum bid price requirement and its common stock continues to be listed and traded on The Nasdaq Capital Market.The Company previously received a notice from The Nasdaq Stock Market stating it was not in compliance with the minimum bid price requirement set forth in Nasdaq Listing Rule 5550(a)(2). However, the trading price of the Company's common stock closed above $1.00 per share for more than ten consecutive trading days and, as a result, the Company received a letter from Nasdaq advising that the Company had regained compliance with the Nasdaq minimum bid price requirement.Second Quarter 2025 Results Conference CallBrian Schaffner, Chief Executive Officer and Interim Chief Financial Officer of Expion360, will host the conference call, followed by a question-and-answer period. The conference call will be accompanied by a presentation, which can be viewed during the webcast or accessed via the investor relations section of the Company's websitehere.To access the call, please use the following information:Date:Wednesday, August 13, 2025Time:4:30 p.m. Eastern Time (1:30 p.m. Pacific Time)Dial-in:1-844-825-9789International Dial-in:1-412-317-5180Conference Code:10200569Webcast:XPON Q2 2025 Financial Results Conference CallA telephone replay will be available approximately three hours after the call and will remain available through August 27, 2025, by dialing 1-844-512-2921 from the U.S., or 1-412-317-6671 from international locations, and entering replay pin number: 10200569. The replay can also be viewed through the webcast link above and the presentation utilized during the call will be available via the investor relations section of the Company's websitehere.About Expion360Expion360 is an industry leader in premium lithium iron phosphate (LiFePO4) batteries and accessories for recreational vehicles, marine applications, Light EV and residential energy storage.The Company's lithium-ion batteries feature half the weight of standard lead-acid batteries while delivering three times the power and ten times the number of charging cycles. Expion360 batteries also feature better construction and reliability compared to other lithium-ion batteries on the market due to their superior design and quality materials. Specially reinforced, fiberglass-infused, premium ABS and solid mechanical connections help provide top performance and safety. With Expion360 batteries, adventurers can enjoy the most beautiful and remote places on Earth even longer.The Company is headquartered in Redmond, Oregon. Expion360 lithium-ion batteries are available today through more than 300 dealers, wholesalers, private-label customers, and OEMs across the country.To learn more about the Company, visitexpion360.com.Forward-Looking StatementsThe foregoing material may contain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, each as amended. Forward-looking statements include all statements that do not relate solely to historical or current facts, including without limitation statements regarding the Company's business prospects, and can be identified by the use of words such as \"may,\" \"will,\" \"expect,\" \"project,\" \"estimate,\" \"anticipate,\" \"plan,\" \"believe,\" \"potential,\" \"should,\" \"continue\" or the negative versions of those words or other comparable words. Forward-looking statements included in this press release include, but are not limited to, statements relating to the Company's ability to execute on its growth strategy and initiatives, and expand sales to new and existing customers; the Company's ability to implement cost mitigation efforts, including diversifying its supply chain and onshoring manufacturing; the impact of tariffs on the Company's business and financial results, and its ability to mitigate those impacts; and the Company's ability to expand its product portfolio and introduce new technologies. Forward-looking statements are not guarantees of future actions or performance. These forward-looking statements are based on information currently available to the Company and its current plans or expectations and are subject to a number of risks and uncertainties that could significantly affect current plans. Should one or more of these risks or uncertainties materialize, or the underlying assumptions prove incorrect, actual results may differ significantly from those anticipated, believed, estimated, expected, intended, or planned. Although the Company believes that the expectations reflected in the forward-looking statements are reasonable, the Company cannot guarantee future results, performance, or achievements. Except as required by applicable law or Nasdaq listing standards, the Company does not intend to update any of the forward-looking statements to conform these statements to actual results.Company Contact:Brian Schaffner, CEO and Interim CFO541-797-6714Email ContactExternal Investor Relations:Chris Tyson, Executive Vice PresidentMZ Group - MZ North America949-491-8235XPON@mzgroup.uswww.mzgroup.usEXPION360 INC.BALANCE SHEETSAs ofJune 30, 2025(Unaudited)As ofDecember 31,2024AssetsCurrent AssetsCash and cash equivalents$684,920$547,565Accounts receivable, net715,724613,022Inventory5,138,2634,831,461Prepaid/in-transit inventory485,5071,612,686Prepaid expenses and other current assets350,848236,461Total current assets7,375,2627,841,195Property and equipment807,082914,081Accumulated depreciation(427,459)(430,191)Property and equipment, net379,623483,890Other AssetsOperating leases – right-of-use assets818,188754,832Deposits32,01627,471Total other assets850,204782,303Total assets$8,605,089$9,107,388Liabilities and stockholders' equityCurrent liabilitiesAccounts payable$675,351$338,091Customer deposits48,69348,474Accrued expenses and other current liabilities250,390187,464Current portion of operating lease liability318,335256,153Current portion of long-term debt30,77231,758Suspended Liability4,485,9484,985,948Total current liabilities5,809,4895,847,888Long-term debt, net of current portion and discount182,842198,412Operating lease liability, net of current portion545,535542,764Total liabilities$6,537,866$6,589,064Stockholders' equityPreferred stock, par value $0.001 per share; 20,000,000 shares authorized; 0 shares issued and outstanding as of June 30, 2025 and December 31, 2024——Common stock, par value $0.001 per share; 200,000,000 shares authorized; 3,374,468 and 2,096,082 shares issued and outstanding as of June 30, 2025 and December 31, 2024, respectively3,3742,096Additional paid-in capital39,159,94737,091,468Accumulated deficit(37,096,098)(34,575,240)Total stockholders' equity2,067,2232,518,324Total liabilities and stockholders' equity$8,605,089$9,107,388EXPION360 INC.STATEMENTS OF OPERATIONS (UNAUDITED)For the Three Months EndedJune 30,For the Six Months EndedJune 30,2025202420252024Net sales$2,989,947$1,278,109$5,039,278$2,249,967Cost of sales2,367,337952,6463,915,1011,701,982Gross profit622,610325,4631,124,177547,985Selling, general and administrative1,972,8062,004,2603,622,2414,193,734Loss from operations(1,350,196)(1,678,797)(2,498,064)(3,645,749)Other expenseInterest income—(18,596)(1)(45,460)Interest expense3,649250,5609,317503,846Loss on sale of property and equipment14,978—13,353306Settlement expense—309,000—309,000Other (income) / expense—1150(1,189)Total other expense18,627540,97522,719766,503Loss before income taxes(1,368,823)(2,219,772)(2,520,783)(4,412,252)Franchise taxes3746075920Net loss$(1,368,860)$(2,220,232)$(2,520,858)$(4,413,172)Net loss per share (basic and diluted)$(0.41)$(30.20)$(0.78)$(61.48)Weighted-average number of common shares outstanding3,335,23773,5173,223,00371,787EXPION360 INC.STATEMENTS OF CASH FLOWS (UNAUDITED)For the Six Months Ended June 30,20252024Cash flows from operating activitiesNet loss$(2,520,858)$(4,413,172)Adjustments to reconcile net loss to net cash provided by (used in) operating activities:Depreciation65,24494,866Amortization of convertible note costs—333,572Loss on sale of property and equipment13,353306Stock-based settlement—209,000Stock-based compensation183,950438,923Issuance of common stock in exchange for services106,250—Non-cash expense in exchange for asset disposal21,420—Changes in operating assets and liabilities:Increase in accounts receivable(102,702)(198,071)(Increase) / Decrease in inventory(306,802)463,558(Increase) / Decrease in prepaid/in-transit inventory1,127,179(555,338)Increase in prepaid expenses and other current assets(114,387)(27,242)Increase in deposits(4,545)—Increase in accounts payable337,260145,566Increase / (Decrease) in customer deposits219(3,329)Increase in accrued expenses and other current liabilities62,92698,166Increase in right-of-use assets and lease liabilities1,5976,929Decrease in suspended liability(500,000)—Net cash used in operating activities(1,629,896)(3,406,266)Cash flows from investing activitiesPurchases of property and equipment—(10,550)Net proceeds from sale of property and equipment4,25087,684Net cash provided by investing activities4,25077,134Cash flows from financing activitiesPrincipal payments on convertible note—(365,671)Principal payments on long-term debt(16,556)(101,560)Principal payments on stockholder promissory notes—(62,500)Net proceeds from exercise of warrants—(4)Net proceeds from issuance of common stock1,779,557828,492Net cash provided by financing activities1,763,001298,757Net change in cash and cash equivalents137,355(3,030,375)Cash and cash equivalents, beginning547,5653,932,698Cash and cash equivalents, ending684,920902,323Search by:Symbol(s)Comma-seperate tickers for multi-ticker search. Use*to search for articles mentioning at least 1 ticker.KeywordsElon Musklooks for \"Elon\" OR \"Musk\"Put phrase inside quotes for an exact match. This is particularly useful for names:\"Elon Musk\",\"FDA Approval\"Use the minus (-) operator to exclude results which match specific keywords:\"Elon Musk\" -TeslaUse*as wildcard to match any character:acqui*matchesacquireandacquisitionUse AND to search for multiple keywords in the same article:Tesla AND \"Elon Musk\"Use OR to search for multiple keywords in the same article:\"Elon Musk\" OR \"Jack Dorsey\"Source(s)Select...SearchMarketsLatest NewsAnalyst RatingsEarnings Call TranscriptsSPACs & IPOsFDA ApprovalsShow moreSector NewsHealthcareTechnologyEnergyIndustrialsConsumer DefensiveShow moreLatest FromCNBCReutersBloombergPR NewswireWall Street JournalShow moreUS GovernmentSEC FilingsClinical TrialsPatent Applications & ApprovalsFDA - Drug ApprovalsFDA - Press ReleasesShow moreAPI, DevelopersAPI DocumentationAPI PricingDiscord News BotAccountSign InCreate Free AccountTerms|PrivacyRisk Disclosure: Trading in financial instruments and/or cryptocurrencies involves high risks including the risk of losing some, or all, of your investment amount, and may not be suitable for all investors. Prices of cryptocurrencies are extremely volatile and may be affected by external factors such as financial, regulatory or political events. Trading on margin increases the financial risks. Before deciding to trade in financial instrument or cryptocurrencies you should be fully informed of the risks and costs associated with trading the financial markets, carefully consider your investment objectives, level of experience, and risk appetite, and seek professional advice where needed. We would like to remind you that the data contained in this website is not necessarily real-time nor accurate. The data and prices on the website are not necessarily provided by any market or exchange, but may be provided by market makers, and so prices may not be accurate and may differ from the actual price at any given market, meaning prices are indicative and not appropriate for trading purposes. We and any provider of the data contained in this website will not accept liability for any loss or damage as a result of your trading, or your reliance on the information contained within this website. It is prohibited to use, store, reproduce, display, modify, transmit or distribute the data contained in this website without the explicit prior written permission of we and/or the data provider. All intellectual property rights are reserved by the providers and/or the exchange providing the data contained in this website. We may be compensated by the advertisers that appear on the website, based on your interaction with the advertisements or advertisers."
    }
  ],
  "timestamp": "2025-08-14T22:22:43.315296",
  "symbol": "XPON",
  "type": "news"
}